ConfigFiles/InformationRegisters/РезультатыПроверкиОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РезультатыПроверкиОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Информация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исключение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ошибки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПравилоПроверкиОбъектов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаПроверкиОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектПроверки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Процессы</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрофилиПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Подсистемы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТехническиеПроекты</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыДоступа</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФункцииСистемы</v8:Type>
						<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
						<v8:Type>cfg:CatalogRef.РазделыПроекта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭлементОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШагиПроцесса</v8:Type>
						<v8:Type>cfg:CatalogRef.РеквизитыОбъектовМетаданных</v8:Type>
						<v8:Type>cfg:CatalogRef.МакетыОбъектовМетаданных</v8:Type>
						<v8:Type>cfg:CatalogRef.ФормыОбъектовМетаданных</v8:Type>
						<v8:Type>cfg:CatalogRef.ФункцииМеханизмов</v8:Type>
						<v8:Type>cfg:CatalogRef.ПредопределенныеДанные</v8:Type>
						<v8:Type>cfg:CatalogRef.КомандыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ConfigFiles/InformationRegisters/РезультатыПроверкиОбъектов/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	// Измерение Номер заполняется для обеспечения уникальности записей
	
	Если НЕ ЭтотОбъект.Отбор.Номер.Использование Тогда
		ПрисвоитьНомераЗаписямНабора();
	КонецЕсли;
	
	// Флаг исключения заполняется на основании ранее установленного значения
	
	УстановитьФлагиИсключенияЗаписямНабора();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПрисвоитьНомераЗаписямНабора()
	
	Номер = 0;
	Для каждого Запись Из ЭтотОбъект Цикл
		Номер = Номер + 1;
		Запись.Номер = Номер;
	КонецЦикла;
		
КонецПроцедуры

Процедура УстановитьФлагиИсключенияЗаписямНабора()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РезультатыПроверкиОбъектов.ПравилоПроверкиОбъектов,
	|	РезультатыПроверкиОбъектов.ОбъектПроверки,
	|	РезультатыПроверкиОбъектов.ЭлементОбъекта,
	|	РезультатыПроверкиОбъектов.Информация
	|ИЗ
	|	РегистрСведений.РезультатыПроверкиОбъектов КАК РезультатыПроверкиОбъектов
	|ГДЕ
	|	РезультатыПроверкиОбъектов.Исключение";
	
	Если ЭтотОбъект.Отбор.ПравилоПроверкиОбъектов.Использование Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И РезультатыПроверкиОбъектов.ПравилоПроверкиОбъектов = &ПравилоПроверкиОбъектов";
		
		Запрос.УстановитьПараметр("ПравилоПроверкиОбъектов", ЭтотОбъект.Отбор.ПравилоПроверкиОбъектов.Значение);
	КонецЕсли;
	
	Если ЭтотОбъект.Отбор.ОбъектПроверки.Использование Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И РезультатыПроверкиОбъектов.ОбъектПроверки = &ОбъектПроверки";
		
		Запрос.УстановитьПараметр("ОбъектПроверки", ЭтотОбъект.Отбор.ОбъектПроверки.Значение);
	КонецЕсли;
	
	Если ЭтотОбъект.Отбор.ЭлементОбъекта.Использование Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И РезультатыПроверкиОбъектов.ЭлементОбъекта = &ЭлементОбъекта";
		
		Запрос.УстановитьПараметр("ЭлементОбъекта", ЭтотОбъект.Отбор.ОбъектПроверки.Значение);
	КонецЕсли;
	
	ТаблицаИсключений = Запрос.Выполнить().Выгрузить();
	
	ТаблицаИсключений.Свернуть("ПравилоПроверкиОбъектов, ОбъектПроверки, ЭлементОбъекта, Информация");
	ТаблицаИсключений.Индексы.Добавить("ПравилоПроверкиОбъектов, ОбъектПроверки, ЭлементОбъекта, Информация");
	
	ОтборИсключений = Новый Структура("ПравилоПроверкиОбъектов, ОбъектПроверки, ЭлементОбъекта, Информация");
	
	Для каждого Запись Из ЭтотОбъект Цикл
		ЗаполнитьЗначенияСвойств(ОтборИсключений, Запись);
		
		Если ТаблицаИсключений.НайтиСтроки(ОтборИсключений).Количество() > 0 Тогда
			Запись.Исключение = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
